# 1. Introduction

http://www.postgresqltutorial.com provides an example DVD rentals database and [how to download it onto a PostgreSQL database](http://www.postgresqltutorial.com/load-postgresql-sample-database/).

## Import libraries

In [1]:
# Math
import numpy as np
import pandas as pd

# SQL
from sqlalchemy import create_engine

# Misc
from IPython.display import Image
from IPython.core.display import HTML

## Enable PostgreSQL functionality

In [2]:
# Connect to database
%load_ext sql
%sql postgresql://postgres:***@localhost/dvdrental

engine = create_engine('postgresql://postgres:***@localhost/dvdrental');

# 2. DVD Rentals Database

## ER model for the dvd rentals database
Picture from http://www.postgresqltutorial.com

[Info on how to read an ER model](https://www.lucidchart.com/pages/ER-diagram-symbols-and-meaning)

In [3]:
Image(url='dvd-rental-sample-database-diagram.png', width=600, height=600)

## Inserting new values into the film table

In [4]:
%%sql

INSERT INTO film(film_id, title, description, release_year, language_id, rental_duration, rental_rate, length, replacement_cost, rating, last_update)
VALUES
    (1001, 'Watershed Diaries', 'A recollection of moments told at Watershed', '2008', 2, 3, 3.94, 84, 15.99, 'PG-13', '2013-05-26 14:50:58.951000'),
    (1002, 'A Dog Story', 'A theatrical take on the life of a dog', '2014', 3, 3, 3.94, 84, 15.99, 'PG', '2013-05-26 14:50:58.951000'),
    (1003, 'Space Adventures', '3 short stories seemingly unconnected but come together in a powerful way', '2014', 4, 3, 3.94, 84, 15.99, 'PG-13', '2013-05-26 14:50:58.951000'),
    (1004, 'Dear Earth', 'A documentary of Earth as seen through the ages', '2018', 5, 3, 3.94, 84, 15.99, 'PG-13', '2013-05-26 14:50:58.951000'),
    (1005, 'Hopi Life', 'A documentary of the Hopi tribe and their way of life', '2017', 6, 3, 3.94, 84, 15.99, 'PG-13', '2013-05-26 14:50:58.951000')
ON CONFLICT DO NOTHING;

 * postgresql://postgres:***@localhost/dvdrental
0 rows affected.

[]

In [5]:
%%sql

SELECT * FROM film
WHERE film_id BETWEEN 1001 AND 1005

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(1001, 'Watershed Diaries', 'A recollection of moments told at Watershed', 2008, 2, 3, Decimal('3.94'), 84, Decimal('15.99'), 'PG-13', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), None, "'diari':2 'moment':6 'recollect':4 'told':7 'watersh':1,9"),
 (1002, 'A Dog Story', 'A theatrical take on the life of a dog', 2014, 3, 3, Decimal('3.94'), 84, Decimal('15.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), None, "'dog':2,12 'life':9 'stori':3 'take':6 'theatric':5"),
 (1003, 'Space Adventures', '3 short stories seemingly unconnected but come together in a powerful way', 2014, 4, 3, Decimal('3.94'), 84, Decimal('15.99'), 'PG-13', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), None, "'3':3 'adventur':2 'come':9 'power':13 'seem':6 'short':4 'space':1 'stori':5 'togeth':10 'unconnect':7 'way':14"),
 (1004, 'Dear Earth', 'A documentary of Earth as seen through the ages', 2018, 5, 3, Decimal('3.94'), 84, Decimal('15.99'), 'PG-13', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), None, "'age':11 'dear':1 'documentari':4 'earth':2,6 'seen':8"),
 (1005, 'Hopi Life', 'A documentary of the Hopi tribe and their way of life', 2017, 6, 3, Decimal('3.94'), 84, Decimal('15.99'), 'PG-13', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), None, "'documentari':4 'hopi':1,7 'life':2,13 'tribe':8 'way':11")]

## Inner joins

Joins 2 tables together and keep the records that have the same values in a specified column.

### Example: Find all staff emails that have an associated store_id

In [6]:
%%sql

SELECT
    staff.email
FROM
    staff
INNER JOIN
    store ON staff.store_id = store.store_id;

 * postgresql://postgres:***@localhost/dvdrental
2 rows affected.

[('Mike.Hillyer@sakilastaff.com',), ('Jon.Stephens@sakilastaff.com',)]

### Find all customers that have made a rental
Include:
> 1. First name
> 2. Last name
> 3. Email
> 4. Date rented
> 5. Film title

Move across tables starting at: customer -> rental -> inventory -> film.

In [7]:
%%sql

SELECT
    customer.first_name,
    customer.last_name,
    customer.email,
    rental.rental_date,
    film.title
FROM
    customer
INNER JOIN
    rental ON customer.customer_id = rental.customer_id
INNER JOIN
    inventory ON rental.inventory_id = inventory.inventory_id
INNER JOIN
    film ON inventory.film_id = film.film_id
ORDER BY
    first_name ASC
LIMIT 7;

 * postgresql://postgres:***@localhost/dvdrental
7 rows affected.

[('Aaron', 'Selby', 'aaron.selby@sakilacustomer.org', datetime.datetime(2005, 5, 29, 9, 33, 33), 'Drifter Commandments'),
 ('Aaron', 'Selby', 'aaron.selby@sakilacustomer.org', datetime.datetime(2005, 6, 15, 21, 58, 7), 'Arachnophobia Rollercoaster'),
 ('Aaron', 'Selby', 'aaron.selby@sakilacustomer.org', datetime.datetime(2005, 5, 26, 21, 48, 13), 'Dorado Notting'),
 ('Aaron', 'Selby', 'aaron.selby@sakilacustomer.org', datetime.datetime(2005, 5, 27, 14, 17, 23), 'Fellowship Autumn'),
 ('Aaron', 'Selby', 'aaron.selby@sakilacustomer.org', datetime.datetime(2005, 5, 30, 5, 15, 20), 'Zhivago Core'),
 ('Aaron', 'Selby', 'aaron.selby@sakilacustomer.org', datetime.datetime(2005, 6, 15, 16, 38, 53), 'Muscle Bright'),
 ('Aaron', 'Selby', 'aaron.selby@sakilacustomer.org', datetime.datetime(2005, 6, 18, 4, 12, 33), 'Sweden Shining')]

## Group bys
Groups rows that have the same values and is used in conjunction with aggregate functions (i.e. count, max, min, sum, avg).

### Group films by language

In [8]:
%%sql

SELECT
    language.name,
    language.language_id
FROM
    language

 * postgresql://postgres:***@localhost/dvdrental
6 rows affected.

[('English             ', 1),
 ('Italian             ', 2),
 ('Japanese            ', 3),
 ('Mandarin            ', 4),
 ('French              ', 5),
 ('German              ', 6)]

In [9]:
%%sql

SELECT
    language.name,
    COUNT(film.film_id) number_of_films
FROM
    film
INNER JOIN
    language ON film.language_id = language.language_id
GROUP BY
    language.language_id;

 * postgresql://postgres:***@localhost/dvdrental
6 rows affected.

[('German              ', 1),
 ('English             ', 1000),
 ('Japanese            ', 1),
 ('French              ', 1),
 ('Mandarin            ', 1),
 ('Italian             ', 1)]

## Subqueries

### Rank films by the number of times rented
The code below has a created table called 'y' that compiles data from three tables (3 columns: 1. inventory_id, 2. film_id and 3. title) and is the subquery. The table contains information from all rentals for which we have matching data on. Another query is made on this, which counts the number of rentals per film.

In [10]:
%%sql

SELECT
    y.title AS film_title,
    COUNT(y.title) AS num_rentals
FROM
    (SELECT
        rental.inventory_id,
        inventory.film_id,
        film.title
    FROM
        rental
    INNER JOIN
        inventory ON rental.inventory_id = inventory.inventory_id
    INNER JOIN
        film ON inventory.film_id = film.film_id) y
GROUP BY
    y.title
ORDER BY
    num_rentals DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Bucket Brotherhood', 34),
 ('Rocketeer Mother', 33),
 ('Juggler Hardly', 32),
 ('Ridgemont Submarine', 32),
 ('Grit Clockwork', 32),
 ('Forward Temple', 32),
 ('Scalawag Duck', 32),
 ('Apache Divine', 31),
 ('Goodfellas Salute', 31),
 ('Rush Goodfellas', 31)]

### Alternative method
Uses the WITH clause to store the first query.

## With statements
[Doc](https://www.postgresql.org/docs/9.1/queries-with.html)

In [12]:
%%sql

SELECT
        rental.inventory_id,
        inventory.film_id,
        film.title
FROM
    rental
INNER JOIN
    inventory ON rental.inventory_id = inventory.inventory_id
INNER JOIN
    film ON inventory.film_id = film.film_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[(1, 1, 'Academy Dinosaur'),
 (1, 1, 'Academy Dinosaur'),
 (1, 1, 'Academy Dinosaur'),
 (2, 1, 'Academy Dinosaur'),
 (2, 1, 'Academy Dinosaur'),
 (2, 1, 'Academy Dinosaur'),
 (2, 1, 'Academy Dinosaur'),
 (2, 1, 'Academy Dinosaur'),
 (3, 1, 'Academy Dinosaur'),
 (3, 1, 'Academy Dinosaur')]

In [23]:
%%sql

WITH rental AS(
    SELECT
            rental.inventory_id,
            inventory.film_id,
            film.title
    FROM
        rental
    INNER JOIN
        inventory ON rental.inventory_id = inventory.inventory_id
    INNER JOIN
        film ON inventory.film_id = film.film_id)

 * postgresql://postgres:***@localhost/dvdrental
(psycopg2.errors.SyntaxError) syntax error at end of input
LINE 11:         film ON inventory.film_id = film.film_id)
                                                          ^

[SQL: WITH rental AS(
    SELECT
            rental.inventory_id,
            inventory.film_id,
            film.title
    FROM
        rental
    INNER JOIN
        inventory ON rental.inventory_id = inventory.inventory_id
    INNER JOIN
        film ON inventory.film_id = film.film_id)]
(Background on this error at: http://sqlalche.me/e/f405)